### 📖 Terraform Plan (infra/resources/prod) - success
<details>
<summary>Show Plan</summary>

```hcl
  # module.iam_kv.module.kv_func["6af06a8e-d9b4-458a-a02f-eee8bd87081e"].module.key_vault.azurerm_role_assignment.secrets["io-p-itn-auth-main-rg-01|io-p-itn-auth-kv-01|reader"] will be created
  + resource "azurerm_role_assignment" "secrets" {
      + condition_version                = (known after apply)
      + description                      = "Grant read access to Key Vault secrets for provided Function Apps"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "6af06a8e-d9b4-458a-a02f-eee8bd87081e"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets User"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-main-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-auth-kv-01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.iam_kv.module.kv_func["c60e62e1-05cb-43d0-a958-9b75153184d2"].module.key_vault.azurerm_role_assignment.secrets["io-p-itn-auth-main-rg-01|io-p-itn-auth-kv-01|reader"] will be created
  + resource "azurerm_role_assignment" "secrets" {
      + condition_version                = (known after apply)
      + description                      = "Grant read access to Key Vault secrets for provided Function Apps"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "c60e62e1-05cb-43d0-a958-9b75153184d2"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets User"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-main-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-auth-kv-01"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

</details>
